Merge pull request #12 from Rohitisavailable/update
Implement CSRF protection and update admin account creation process; enhance templates with CSRF tokens
